In [1]:
import pandas as pd

In [2]:
data = {
    "Nome": ["Téo", "Nah", "Maria", "Nah", "Lara", "Téo"],
    "Idade": [32,33,2,33,31,32],
    "updated_at":[1,2,3,1,2,3]
}

In [6]:
df = pd.DataFrame(data)
df

    Nome  Idade  updated_at
0    Téo     32           1
1    Nah     33           2
2  Maria      2           3
3    Nah     33           1
4   Lara     31           2
5    Téo     32           3

In [10]:
df = (df.sort_values(by="updated_at", ascending=False)
      .drop_duplicates(subset="Nome", keep="first"))

df

    Nome  Idade  updated_at
5    Téo     32           3
2  Maria      2           3
4   Lara     31           2
1    Nah     33           2